Охотники_и_рыболовы/src/Documents/УстановкаОбщихКвот/УстановкаОбщихКвот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаОбщихКвот</name>
  <registerRecords>AccumulationRegister.ОбщиеКвотыНаОхотхозяйство</registerRecords>
  <attributes>
    <name>СезонОхоты</name>
    <type>
      <types>CatalogRef.СезоныОхоты</types>
    </type>
  </attributes>
  <attributes>
    <name>Охотхозяйство</name>
    <type>
      <types>CatalogRef.Охотхозяйства</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СоставДичи</name>
    <attributes>
      <name>ВидДичи</name>
      <type>
        <types>CatalogRef.ВидыДичи</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбщееКоличество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Охотники_и_рыболовы/src/Documents/УстановкаОбщихКвот/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ РольДоступна("ПолныеПрава") Тогда
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка прав доступа");
		Возврат;
	Иначе
		ОснОтветственный = ПредопределенноеЗначение("ПланВидовХарактеристик.НастройкиПользователей.ОсновнойОтветственный");
		Объект.Ответственный = ОхотаСерверПовтИсп.ПолучитьНастройкуПользователя(ОснОтветственный);	
	КонецЕсли;	
	ТекущийСезон = ОхотаСерверПовтИсп.ПолучитьТекущийСезон();
	
	Если ТекущийСезон.Пустая() Тогда
		ТекстСообщения = "Сезон охоты не открыт";
		Поле = "Объект.СезонОхоты";
		ОхотаСервер.ПоказатьСообщение(ТекстСообщения,Поле);
		Отказ = Истина;
		Возврат;
	ИначеЕсли Объект.СезонОхоты.Пустая() Тогда
		Объект.СезонОхоты = ТекущийСезон;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура СоставДичиВидДичиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ДанныеВыбора = ПодобратьДанные();
	
	Если ДанныеВыбора.Количество() = 0 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Необходимо заполнить справочник виды дичи";
		Сообщение.Сообщить();
	Иначе
		СписокВыбора = Элементы.СоставДичиВидДичи.СписокВыбора;
		СписокВыбора.Очистить();
		
		Для каждого эл из ДанныеВыбора Цикл
			ЗаполнитьЗначенияСвойств(СписокВыбора.Добавить(),эл);
		КонецЦикла;	
		СписокВыбора.СортироватьПоПредставлению();
	КонецЕсли;	
	
КонецПроцедуры


&НаСервере
Функция ПодобратьДанные()
	
	ПараметрыПодбора    =    Новый Структура("Отбор,СтрокаПоиска,ВыборГруппИЭлементов",
	Новый Структура(), 
	"",                
	ПредопределенноеЗначение("ИспользованиеГруппИЭлементов.Элементы"));
	
	
	ПараметрыПодбора.Вставить("ДополнительныеПараметры", Новый Структура("ВидыДичи",Объект.СоставДичи.Выгрузить(,"ВидДичи")));
	
	Возврат    ПолучитьДанныеВыбора(Тип("СправочникСсылка.ВидыДичи"), ПараметрыПодбора);
	
	
КонецФункции
